{
    "menu": {
        "home": "Home",
        "tutorial": "Competitor Guide",
        "program": "Schedule",
        "competitions": "Competitions",
        "location": "Location",
        "patreons": "Partners",
        "results": "Results",
        "contact": "Contact",
        "timetable": "Timetable",
        "plan": "Building plan",
        "competitor-zone": "Competitor Zone",
        "app-rules": "Regulations and privacy policy",
        "hello": "Hello",
        "logout": "Logout",
        "uuid": "User UUID:"
    },
    "home": {
        "event-info": {
            "status": {
                "ended": "Event is ended",
                "live": "Event is now live!",
                "coming": "Event starts in"
            },
            "time": {
                "days": "Days",
                "hours": "Hours",
                "minutes": "Minutes",
                "seconds": "Seconds"
            },
            "covid": {
                "1": "Entry to the event is completely free. During the event on the premises, it is mandatory to comply with the regulations in the tab",
                "2": "'Regulations and privacy policy'",
                "3": "and follow epidemiological restrictions, e.g. disinfecting hands and wearing masks."
            },
            "university": {
                "hall": "Regional Sports and Entertainment Center",
                "name": "\"Podpromie\""
            },
            "details": "XChallenge aims to implement many categories of competitions at the international level, where competitors will be able to test their manual and programming skills. The competition is intended for both high school students and university students, but there will also be some competition for younger and older participants. The competition offers not only material rewards, but also experience gained from people from all over the world and new contacts",
            "results": "See the results!",
            "open": "Registration is still open!",
            "important": "Important informations for the constructors of robots in the categories Line Follower, Drag Race, Micromouse and SmashBots by RoboLAB (28.10.2021)",
            "important-choose": "!!! IMPORTANT !!! Survey for players"

        },
        "event-program": {
            "eventsList": [
                { "id": 1, "name": "Exciting competitions", "description": "Participants will be able to compete in as many as 8 categories, i.e. 15 competitions. The organizers prepared the arenas for the struggle on the tracks for LineFollowers or Sumo fights. The track itself in the LF category will test the programming and construction skills of many robotics. In addition to the standard competitions, the organizers have prepared many surprises. Every constructor, regardless of whether he is just starting his adventure with electronics or is already experienced, will surely find something for himself. There will also be competition dedicated to LEGO® fans.", "icon": "la-trophy" },
                { "id": 2, "name": "For the first time in Poland", "description": "This year's edition is back with a bang. Therefore, the organizers would like to invite everyone to take part in a special competition by RoboLab: Smash Bots! Powerful, remotely controlled deadly machines will fight in a dedicated closed arena. Due to the first such event in Poland, the organizers reduced the requirements of the machines to 30x30 (maximum height 2 meters). We encourage all lovers, students and pupils to try their hand and take part in this amazing fight. There will be cash prizes up for the podium.", "icon": "la-robot" },
                { "id": 3, "name": "The best constructors", "description": "Each edition of XChallenge brings together many professionals, enthusiasts and scientists in the field of robotics. It is an amazing opportunity to establish new contacts, meet specialists at work or learn the most valuable secrets of technology from people from all over world. Come, show your best side and guarantee yourself a bright future!", "icon": "la-wrench" }
            ]
        },
        "competitions": {
            "title": "COMPETITIONS",
            "learn": "LEARN MORE",
            "regulations": "Rules",
            "categories": [
                { "id": 1, "name": "Smash Bots", "description": "This is the toughest competition in XChallenge! In a special arena, remote-controlled robots will fight each other until the last breath. Sparks and flames are guaranteed here.", "icon": "battlebot.gif", "linkToRegulation": "https://bit.ly/xchallengeSB22rules" },
                { "id": 2, "name": "Task Hunters", "description": "The team and its robot must face the tasks and score as many points as possible in the previously prepared arenas. There will be a lot going on here!", "icon": "task_hunters.gif", "linkToRegulation": "https://bit.ly/xchallengeTH22rules" },
                { "id": 3, "name": "Freestyle", "description": "In this competition, competitors can put on any project, robot or machine. The structures are assessed by referees and visitors. Each voter completes a questionnaire in which they award points for each project, so it is important that each competitor presents their project in the best possible way.", "icon": "freestyle.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22FSrules" },
                { "id": 4, "name": "Line Follower", "description": "The goal of the robot in this competition is to follow the route marked by the black line drawn on the board as quickly as possible. The robot must follow the line as accurately as possible, without avoiding or cutting corners.", "icon": "line_follower.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22LFrules" },
                { "id": 5, "name": "Micromouse", "description": "The robot's task is to find the fastest path from the starting field to the area consisting of four fields arranged in a square. The robot must be very accurate so that it does not bounce off the walls.", "icon": "micromouse.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22MMrules" },
                { "id": 6, "name": "Onion House", "description": "It is a modified version of the competition known as Ketchup House. We focused on Polish products and flavors, so onions will be the subject of our competition. Because why not? You can come to this competition with independently selected onions.", "icon": "onion_house.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22CHrules" },
                { "id": 7, "name": "Sumo", "description": "Robots like SUMO wrestlers must push the opponent out of a specially prepared ring. Many categories will allow you to easily select the appropriate robot class for your preferences and capabilities.", "icon": "sumo.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22SMrules" },
                { "id": 8, "name": "LEGO® Tug of War", "description": "This competition is also brand new! Two robots facing each other will compete in tugging the rope. The winner is the one who manages to pull most of the rope to his side. This competition is only intended for robots made of LEGO® bricks.", "icon": "tug_of_war.gif", "linkToRegulation": "https://bit.ly/xchallengeRM22TOWrules" }
            ]
        },
        "news": {
            "title": "IMPORTANT INFORMATIONS",
            "info": "At this place, we will provide you with the most important information for the players and the audience.",
            "register": "Registration is not currently possible. The opening date will be announced shortly.",
            "register-limit": {
                "title": "REGISTRATION IS COMPLETE",
                "body1": "The limit of people registered for the event is approaching. Currently {{registerPercentageCompletion}}% places are full.",
                "body2": "There are {{days}} days remaining to register robots."
            },
            "points": {
                "register-start": {
                    "title": "Start of registration",
                    "content": "From now on, you can start registering in the Competitor Zone. Remember to add all your robots along with their documentation and videos (for selected competitions)."
                },
                "register-end": {
                    "title": "End of registration",
                    "content": "Until then, modifications can be made to the notified robots and their constructors. Please check carefully that all the entered data is correct. AFTER THE REGISTRATION IS FINISHED, IT IS IMPOSSIBLE TO CHANGE YOUR DATA!"
                },
                "event-start": {
                    "title": "XChallenge competition",
                    "content": "We are all waiting for it! We guarantee unforgettable emotions during fights and races that will last for the entire 2 days! We cordially invite everyone interested to watch the games live and on streaming platforms."
                },
                "now": {
                    "title": "Now",
                    "content": {
                        "0": "We are still before the registration opens. Now is a great time to plan and build robots, think strategies and gather a team.",
                        "1": "Registration is now underway. Do not wait any longer to let us know about your arrival in Rzeszów at XChallenge! Read carefully the rules of yours competitions and finish everything. Remember that EVERY ROBOT CONSTRUCTOR MUST REGISTER IN OUR SYSTEM. ",
                        "2": "This is the last straight before the competition. Now, all that remains is to wait ... I'll see you there soon! PS. Remember that you need to gather your team before setting off;)",
                        "3": "The XChallenge competition is now underway! We encourage everyone to come to the Regional Sports and Entertainment Center \"Podpromie\" in Rzeszów to watch the competitors' struggles in the categories we have prepared.",
                        "4": "The XChallenge is over. It was a great time! We invite you to share your views on our social media and in the polls. Congratulations to all the winners and thank you for your participation. See you next year!"
                    }
                }
            }
        },
        "categories": {
            "title": "Categories",
            "learn-more": "Learn more >>",
            "task-hunters": {
                "description": "Task Hunters is a competition where teams design, construct and program a robot that must perform specific tasks in previously prepared arenas. The main goal of the competition is to use the so-called competences of the future to build a remote-controlled robot together with teammates. Competitors will have to be creative in order to face tasks related to global problems. The robot can be built with any techniques, from structures made of wood, 3D printing, to milled in metal on CNC machine tools. The competition does not impose any limits to the number and type of engines or control processors used. The only limitations are the dimensions of the robot and its weight.",
                "introduction": {
                    "title": "Introduction",
                    "description": {
                        "1": "Time flies very slowly in Starlight City. The city is known for its industry and great logistics network. Starlight City is self-sufficient thanks to the nearby river and a power plant, the reactor of which generates clean energy from special energy cubes. A long time ago, the inhabitants developed an endless source of energy, energy cubes created by the reactions of many elements containing enormous layers of power. Years of research and work have resulted in the construction of a power plant capable of converting the energy of cubes into electricity, providing power to industrial, commercial and residential areas, while protecting the environment by generating clean energy.",
                        "2": "Unfortunately, one day there was an event that significantly influenced the functioning of individual parts of the city. The power plant stopped working. Electricity stopped flowing through the power grid, paralyzing the entire city. To find out what happened and avert the disaster, the city set up a team of volunteers to solve the mystery, who immediately went to the power plant."
                    },
                    "stages": {
                        "1": {
                            "title": "Stage 1",
                            "description": "Upon reaching the site, the Task Hunters team analyzes the situation. The first task is to overcome the security of a power plant that can only be reached by mobile robots. In order to be able to get close to it, a complicated maze awaits the volunteers, which must be overcome in the shortest possible time. Dangerous opponents await the team, who attack the vehicle with special balls, making it difficult to ride. Having reached the side of the power plant, the team discovers the source of the disaster - a wall explosion! As a result of the explosion, energy cubes jumped out of the reactor's warehouse and landed in different places on the premises of the facility and the wall itself lies in pieces on the premises of the facility. The power plant must be brought back into operation quickly! The robot has to get to the energy cubes, paying attention to obstacles in the area, and then take them and put them in the reactor warehouse by matching the size and color of energy cubes to the appropriate places in the warehouse. Both the color and size define the power of the cube, make no mistake about that."
                        },
                        "2": {
                            "title": "Stage 2",
                            "description": "However, proper arrangement of energy cubes itself will not activate the reactor - it must be excited using the power plant's built-in starter modules. In the event of an accident, two neutral systems to initiate the reactor activator were used, and it is up to a team of volunteers to decide which path they will go. In the first option, the mobile robot must properly set the energy paths using logic gates to power the activator module. In the second option, the mobile robot must cross the platform with a precipice to reach the button that activates the power supply of the activator module. To be able to cross the platform, the robot must find the platform element and place it in the right place to make a bridge. By completing these tasks, the team gets access to special power balls required to speed up the reactor. After a preset time, the gates to the inside of the reactor open and the mobile robot can drive through them. There are power balls on the spot that need to be fired towards the base of the reactor. The impact force of the power balls generates energy that allows the reactor to accelerate and start. The more power balls, the more energy the power plant generates. How much power will the reactor reach and how much energy will the power plant start to generate? What really happened at the power plant that made it stop working? When looking for clues, a team of volunteers must uncover the mystery so that the situation will never happen again."
                        }
                    }
                }
            },
            "smash-bots": {
                "description": "Smash Bots is one of the most spectacular competitions, where remote-controlled robots fight each other in a specially prepared arena. This competition is based on a simple rule that only the robot that survives all the fights wins. The construction of the robot has no restrictions in terms of the materials used, which means that such equipment as hammers, saws or blades are allowed. The only restrictions imposed on competitors are the standards set out in the regulations, such as weight and dimensions of the structure."
            },
            "robomotion": {
                "description": "Participants will be able to compete in as many as 6 competitions divided into categories. Each constructor, regardless of whether he is just starting his adventure with electronics or is already experienced, will surely find something for himself. There will also be competition dedicated to LEGO® fans. Each edition of ROBO ~ motion brings together many professionals, enthusiasts and scientists in the field of robotics. It is an amazing opportunity to establish new contacts, meet specialists at work or learn the most valuable secrets of technology from people from all over the world. Come, show your best side and guarantee yourself a bright future!",
                "statistics": {
                    "title": {
                        "1": "VI edition",
                        "2": "in numbers"
                    },
                    "subtitles": {
                        "fights": "fights and runs",
                        "prizes": "in prizes",
                        "time": "intense struggle",
                        "robots": "robots",
                        "competitors": "competitors",
                        "positive": "positive feedback",
                        "hours": "hours"
                    }
                }
            }
        },
        "gallery": {
            "title": "Gallery",
            "view-more": "View more >>"
        },
        "location": {
            "title": "LOCATION",
            "showOnMap": "Show on map"
        },
        "patreons": {
            "organizer": {
                "title": "ORGANIZERS",
                "name": "Scientific Club of Automation and Robotics “ROBO”"
            },
            "organizer2": {
                "title": "ORGANIZER",
                "name": "Foundation for the Support of Education at the Aviation Valley Association",
                "src": "../../assets/svg/Fundacja-white-en.png"
            },
            "organizer3": {
                "title": "ORGANIZER",
                "name": "RoboLAB – Local STEM Incubator"
            },
            "title": "PATRONS",
            "question": "Do you want to become a patron? Contact us at robo@kneiti.prz.edu.pl",
            "patreonList": [
                { "id": 1, "patreonCategory": 0, "description": "Rzeszow University of Technology im. Ignacego Łukasiewicza", "image": "../../assets/jpg/prz_pl.png", "linkToSite": "https://w.prz.edu.pl/" },
                { "id": 2, "patreonCategory": 0, "description": "Pratt & Whitney", "image": "../../assets/jpg/pratt.png", "linkToSite": "https://pwrze.com/" },
                { "id": 3, "patreonCategory": 0, "description": "Podkarpackie voivodeship", "image": "../../assets/jpg/podkarpackie.png", "linkToSite": "https://podkarpackie.eu/" },
                { "id": 4, "patreonCategory": 1, "description": "Kronospan", "image": "../../assets/jpg/kronospan.png", "linkToSite": "https://kronosfera.pl/" },
                { "id": 5, "patreonCategory": 1, "description": "Alcatel·Lucent Enterprise", "image": "../../assets/jpg/ale-primary-logo-white.png", "linkToSite": "https://www.al-enterprise.com/" },
                { "id": 6, "patreonCategory": 0, "description": "Rzeszów Stolica Innowacji", "image": "../../assets/jpg/rzeszow_stolica_white.png", "linkToSite": "https://www.erzeszow.pl/" },
                { "id": 7, "patreonCategory": 5, "description": "Marszałek Województwa Podkarpackiego", "image": "../../assets/jpg/marszalek.png", "linkToSite": "https://www.podkarpackie.pl/" },
                { "id": 8, "patreonCategory": 5, "description": "Podkarpacki Kurator Oświaty", "image": "../../assets/jpg/kuratorium.png", "linkToSite": "https://www.ko.rzeszow.pl/" },
                { "id": 9, "patreonCategory": 3, "description": "Deloitte", "image": "../../assets/svg/deloitte.svg", "linkToSite": "https://www2.deloitte.com/pl/pl.html" },
                { "id": 10, "patreonCategory": 1, "description": "Wago", "image": "../../assets/svg/wago.png", "linkToSite": "https://www.wago.com/pl/" },
                { "id": 11, "patreonCategory": 5, "description": "Mayor of the City of Rzeszów", "image": "../../assets/jpg/rzeszow.png", "linkToSite": "https://bip.erzeszow.pl/" },
                { "id": 12, "patreonCategory": 6, "description": "zrobotyzowany.pl", "image": "../../assets/jpg/zrobotyzowany.png", "linkToSite": "https://zrobotyzowany.pl/" },
                { "id": 13, "patreonCategory": 2, "description": "MTU", "image": "../../assets/jpg/mtu.png", "linkToSite": "https://www.mtu.de/about-us/mtu-worldwide/mtu-aero-engines-polska/website-polska/" },
                { "id": 14, "patreonCategory": 3, "description": "FANUC", "image": "../../assets/jpg/fanuc.png", "linkToSite": "https://www.fanuc.eu/uk/en" }


            ],
            "tiers": [
                "Main Partner",
                "Gold Partner",
                "Silver Partner",
                "Bronze Partner",
                "Strategic partner",
                "Honorary patronage",
                "Media patronage"
            ]
        },
        "footer": {
            "copyright": "Copyright",
            "designed": "Developed by",
            "developer": "Rafał Nazarko"
        }
    },
    "results": {
        "info": "The results will be shown here"
    },
    "timetable": {
        "info": "The schedule may change. Please keep an eye on this page for the latest information.\nAll categories except Freestyle take place on the main floor of the hall, Robots in the Freestyle category can be viewed in the hallway at the entrance. ONLY people with appropriate IDs can enter the main floor.",
        "time": "Hour",
        "onion": "Onion House",
        "register": "Competitors registration",
        "viewers": "Opening the stands for the audience",
        "brief": "Briefing for all competitors (Competitor's Zone)",
        "open": "OFFICIAL START OF THE INTERNATIONAL ROBOT COMPETITION XCHALLENGE",
        "draw-groups": "Draw groups",
        "draw": "Draw",
        "rides": "Scored runs",
        "fights": "Scored fights",
        "exhibition": "Exhibition",
        "eliminations": "Elimination fights",
        "ride": "Run",
        "fight1": "Fights - 1st round",
        "fight2": "Fights - 2nd round",
        "fight3": "Fights - 3rd round",
        "fight4": "Fights - IV round (FINALS)",
        "break": "Break",
        "technical-break": "Technical break",
        "results": "Announcement of results",
        "comission": "Evaluation of the commission",
        "finals": "Final fights"
    },
    "building-plan": {
        "floor": {
            "name": "Select floor"
        },
        "floors": {
            "P": "Parking",
            "0": "Ground floor",
            "1": "First floor",
            "2": "Second floor",
            "3": "Third floor"
        }
    },
    "competitor-zone": {
        "info": "Competitor zone will be open soon!",
        "confirmation-code": {
            "name": "Confirmation of identity",
            "button": "Log in",
            "incorrect": "Provided incorrect data.",
            "activated": "The user already has a confirmed email.",
            "success": "The account has been confirmed! You can login now."
        },
        "login": {
            "title": "Login",
            "sign-in": "Sign in",
            "havent": "Don't have an account yet?",
            "register": "Sign up!",
            "forgotten": "I forgot my password",
            "errors": {
                "not-found": "There is no such user!",
                "not-activated": "User has not been activated",
                "failed": "Incorrect e-mail or password provided",
                "logout": "Successfully logged out"
            }
        },
        "forgot-password": {
            "title": "Password forgotten",
            "sign-in": "Send code",
            "info": "Enter the e-mail address provided when creating the account. A link will be sent to it with a code needed to reset the password and set a new one.",
            "sended": {
                "1": "On e-mail adress ",
                "2": " has been sent a link with a password reset code. Check your mailbox and complete the password reset procedure."
            },
            "errors": {
                "sended": "Password reset request successfully sent"
            }
        },
        "reset-password": {
            "title": "Password reset",
            "sign-in": "Set a new password",
            "info": "Enter a new password for your account. As soon as you confirm your password, it will take effect as your login details for your account.",
            "errors": {
                "no-params": "No parameters",
                "success": "Successfully set a new password for the account. You can login now!"
            }
        },
        "visitors-counter": {
            "actual": "CURRENT VISITORS:"
        },
        "register": {
            "title": "Register",
            "accept": "I accept the terms and privacy policy",
            "carer": "I am the player's carer",
            "sign-in": "Sign up",
            "have": "Already have an account?",
            "login": "Sign in!",
            "errors": {
                "duplicate": "User with this e-mail already exists!",
                "success": "Successfully registered. Confirm your account via a message sent to the e-mail address provided."
            },
            "food": {
                "Mięsne": "Meat",
                "Wegańskie": "Vegan",
                "Wegetariańskie": "Vegetarian"
            }
        },
        "bar": {
            "my-robots": "MY ROBOTS",
            "settings": "SETTINGS",
            "referee-zone": "REFEREE ZONE",
            "competitors": "COMPETITORS",
            "robots": "ROBOTS",
            "statistics": "STATISTICS",
            "register": "REGISTER",
            "counting": "VISITORS",
            "fights": "FIGHT PLANNER",
            "positions": "POSITIONS",
            "announcements": "ANNOUNCEMENTS",
            "hello": {
                "1": "Welcome to the ",
                "2": "Competitor Zone!",
                "3": " Select one of the activities available in the panel"
            },
            "help": "Help",
            "time-left": "Time until the end of editing robots",
            "time-left-sb": "Time until the end of adding robots in the Smash Bots category",
            "time-up": "Time to edit robots is over!",
            "time-up-sb": "Time to adding robots in the Smash Bots category is over!"

        },
        "my-robots": {
            "title": "MY ROBOTS",
            "add": "Add robot",
            "edit": "Edit",
            "view": "View"
        },
        "new-robot": {
            "category": {
                "name": "Category",
                "validators": {
                    "required": "This field is required"
                }
            },
            "add": "Add",
            "h1": {
                "1": "Add a new ",
                "2": "robot"
            },
            "p": {
                "1": "*We recommend that you do not add more than ",
                "2": "one",
                "3": " robot in a category. This can cause logistic errors and preclude the robot from participating in the games."
            },
            "success": "New robot added successfully"
        },
        "robot": {
            "category": {
                "name": "New category",
                "validators": {
                    "required": "This field is required"
                }
            },
            "uuid": "Robot UUID:",
            "categories": "Categories",
            "too-many-categories": "According to the rules, each robot can be entered into up to four competitions, within which it can choose up to 2 categories (for example, one robot can take part in the Drag Race, LF Standard, LF Standard Enhanced and Micro Mouse, however, it cannot take part in the Drag Race, LF Standard, LF Turbo and LF Standard Enhanced)",
            "constructors": "Constructors",
            "constructors-info": "* You can find it in the main menu on the right or in the settings",
            "update-name": "Robot name successfully updated",
            "add-category": "Category added successfully",
            "delete-category": "Category deleted successfully",
            "add-constructor": "Constructor added successfully",
            "add-constructor-self": "You have been added as a robot constructor with the id:",
            "delete-constructor": "Constructor added successfully",
            "delete-constructor-self": "You have been removed from the list of constructors of the robot with the id:",
            "delete-robot": "Deleted robot with id:",
            "want-to-delete-category": "Delete the category robot makes it impossible to start in this category",
            "want-to-delete-constructor": "Removing the constructor makes user impossible to editing the robot and accessing any rewards",
            "want-to-delete-robot": "Removing the robot excludes its participation in the competition. Attention! This decision cannot be undone!",
            "update-documentation": "Documentation successfully uploaded",
            "documentation-uploaded": "Documentation has already been uploaded",
            "documentation-not-uploaded": "Documentation has not been uploaded",
            "documentation-format-info": "* Possible file formats are: PDF, DOC and DOCX and the maximum file size is 5 MB",
            "update-film": "Successfully sent link to the movie",
            "film-uploaded": "The link to the movie has already been uploaded",
            "film-not-uploaded": "The link to the movie has not been uploaded yet",
            "film-format-info": "* The link should lead to the video on YouTube platform",
            "update-reason": "Successfully updated rejection reason",
            "acceptation-status": "Robot's acceptance status",
            "acceptation-true": "ACCEPTED",
            "acceptation-false": "REJECTED",
            "acceptation-waiting": "WAITING",
            "is-arrived": "Has arrived:",
            "is-arrived-true": "ARRIVED",
            "is-arrived-false": "DIDN'T ARRIVED"
        },
        "settings": {
            "user": "User details",
            "user-info": "* Please provide correct data. On their basis, possible prizes and diplomas will be awarded.",
            "phone": "Contact details",
            "postal": "Statistic data",
            "preferences": "Preferences",
            "phone-info": "* Please provide correct data. On their basis, important messages will be sent.",
            "password": "Change Password",
            "rest-countries": "Rest countries",
            "test": "Test",
            "get-rfid": "Read RFID",
            "get-lap-time": "Read lap time",
            "set-rfid": "Save data to RFID",
            "referee-settings": "Device settings",
            "is-sliding": "Auto sliding results view",
            "is-esp32": "Display the RFID and gateway control panel (computer only)",
            "change": "* Preferences cannot be changed independently after registration. Please contact the administrator to make changes.",
            "errors": {
                "succesfuly-added-phone": "Phone number changed successfully",
                "succesfuly-confirmed": "Data successfully updated",
                "success": "Account password changed successfully",
                "success-name": "User data was successfully edited",
                "copied": "UUID copied to clipboard",
                "copied-lap-time": "Lap time copied to clipboard"

            }
        },
        "add-fight-result": {
            "title": {
                "1": {
                    "1": "ADDING A RESULT",
                    "2": "OF FIGHT"
                }
            },
            "1": {
                "1": "Before you go into combat, check out the robot constructors.",
                "2": "Enter the robot constructor UUID",
                "3": "Call the robot constructors"
            },
            "next": "Next",
            "skip": "Skip",

            "2": {
                "1": "Now you can start the fight. When finished, enter the result.",
                "2": "Enter the number of rounds won by"
            },
            "add": "Add and finish"

        },
        "add-time-result": {
            "title": {
                "1": {
                    "1": "ADDING NEW ",
                    "2": "TIME RESULT",
                    "3": "RESULT"
                },
                "2": {
                    "1": "CHOOSE ",
                    "2": "ROBOT",
                    "3": " OF USER"
                },
                "3": {
                    "1": "ADD ",
                    "2": "TIME RESULT",
                    "3": "RESULT"
                }
            },
            "1": {
                "1": "Before you go to",
                "2": "time result",
                "3": "adding the result",
                "4": ", check out the robot constructor.",
                "5": "Enter the UUID of the arrived constructor"
            },
            "next": "Next",
            "choose": "Choose",
            "2": {
                "1": "Enter the travel time in milliseconds (ms)",
                "2": "Enter the points earned in the game"
            },
            "add": "Add and finish"
        },
        "competitor": {
            "name": "First and last name:",
            "phone": "Phone number: ",
            "email": "Email: ",
            "positions": "Positions: ",
            "postal": "Postal code: ",
            "send": "Send message",
            "robots": "Robots",
            "carer": "Carer",
            "starterpack-given": "Starterpack given"
        },
        "competitors": {
            "title": "COMPETITORS",
            "on-list": "On list: ",
            "categories": "Categories: ",
            "more": "More",
            "filters": {
                "name": "First and last name",
                "user-uuid": "User UUID",
                "positions": "Positions",
                "robots-uuid": "Robot UUID",
                "robots-name": "Robot name",
                "phone": "Phone number",
                "email": "Email",
                "categories": "Categories"
            }
        },
        "referee-zone": {
            "no-categories": "No categories",
            "no-groups": "No gruops",
            "groups": "Groups: ",
            "no-positions": "No positions",
            "no-fights": "No fights",
            "no-results": "No results",
            "end-time": "End time: ",
            "position-name": "Position name: ",
            "next-fight": "Next fight ID: ",
            "more": "More",
            "less": "Less",
            "pts": "pts",
            "category-id": "Category ID: ",
            "robot-id": "Robot ID: ",
            "result-id": "Result ID: ",
            "add": "Add result",
            "added": "Result added",
            "add-time": "Add time result",
            "add-result": "Add result"
        },
        "robots": {
            "title": {
                "1": "ROBOTS ",
                "2": "OF COMPETITORS"
            },
            "confirm": "Confirm arrival of the robot",
            "filters": {
                "name": "Name",
                "uuid": "UUID",
                "categories": "Categories",
                "constructors": "Constructors"
            }
        },
        "results": {
            "title": "RESULTS",
            "filters": {
                "position": "Position",
                "uuid": "Robot UUID",
                "name": "Robot name"
            }
        },
        "categories": {
            "join": "Join now"
        },
        "fights-view": {
            "3rd-fight": "Fight for 3rd place",
            "no-groups": "No groups"
        }
    },
    "app-rules": {
        "spis": {
            "title": "TABLE OF CONTENTS",
            "1": "COOKIES POLICY OF THE XCHALLENGE.PL SITE",
            "2": "XCHALLENGE WEBSITE PRIVACY POLICY",
            "3": "TERMS AND CONDITIONS FOR THE USE OF THE XCHALLENGE APP",
            "4": "TERMS AND CONDITIONS OF INTERNATIONAL COMPETITIONS XCHALLENGE",
            "5": "ADMINISTRATOR'S INFORMATION IN CONNECTION WITH THE PROCESSING OF PERSONAL DATA"
        },
        "rules": [{
                "title": "COOKIES POLICY OF THE XCHALLENGE.PL SITE",
                "description": "The following Cookies Policy sets out the rules for saving and accessing data on Users' Devices using the Website for the purpose of providing electronic services by the Website Administrator.",
                "paragrphs": [{
                        "title": "Definitions",
                        "bodies": [
                            "<b> Website </b> - a website operating at https://xchallenge.pl/",
                            "<b> External website </b> - website of the Administrator's partners, service providers or recipients",
                            "<b> Administrator </b> - Scientific Club of Automation and Robotics 'ROBO', operating at the Rzeszów University of Technology at the address: ul. Wincentego Pola 2, 35-021 Rzeszów, providing electronic services via the Website and storing and gaining access to information in the User's devices",
                            "<b> User </b> - a natural person for whom the Administrator provides services electronically via the Website",
                            "<b> Device </b> - an electronic device with software through which the User gains access to the Website",
                            "<b> Cookies </b> - text data collected in the form of files placed on the User's Device"
                        ]
                    },
                    {
                        "title": "Types of cookies",
                        "bodies": [
                            "<b> Internal cookies </b> - files placed and read from the User's Device by the Website's IT system",
                            "<b> External cookies </b> - files uploaded and read from the User's Device by ICT systems of external websites",
                            "<b> Session Cookies </b> - files uploaded and read from the User's Device by the Website or External Websites during one session of a given Device. After the session ends, the files are removed from the User's Device",
                            "<b> Persistent cookies </b> - files placed and read from the User's Device by the Website or External Services until they are manually deleted. The files are not deleted automatically after the end of the Device session, unless the User's Device configuration is set to the Cookie deletion mode after the end of the Device session"
                        ]
                    },
                    {
                        "title": "Security",
                        "bodies": [
                            "<b> Storage and reading mechanisms </b> - Cookies storage and reading mechanisms do not allow the collection of any personal data or any confidential information from the User's Device. It is practically impossible to transfer viruses, trojans and other worms to the User's Device",
                            "<b> Internal cookies </b> - internal cookies used by the Cookie Administrator are safe for Users' Devices",
                            "<b> External cookies </b> - the Administrator is not responsible for the security of Cookie files from partners of the Website. The list of partners is provided further in the Cookie Policy"
                        ]
                    },
                    {
                        "title": "The purposes for which cookies are used",
                        "bodies": [
                            "<b> Statistical data </b> - The Administrator and external websites use Cookie files to collect and process statistical data, such as, for example, visit statistics, User Device statistics or user behavior statistics. These data are collected in order to analyze and improve the Website. Cookies are used to adapt the content of the Website to the User's preferences and to optimize the use of the Website. They are also used to create anonymous, aggregated statistics that help to understand how the User uses the Website, which allows improving their structure and content, excluding personal identification of the User."
                        ]
                    },
                    {
                        "title": "External websites",
                        "bodies": [
                            "The Administrator cooperates with the following external websites that may place Cookie files on User's Devices:",
                            "<b>Google Analytics</b>"
                        ]
                    },
                    {
                        "title": "Possibilities of determining the conditions of storage and access on User's Devices by the website and external websites",
                        "bodies": [
                            "The user may at any time independently change the settings for saving, deleting and accessing the data of saved cookies",
                            "Information on how to disable cookies in the most popular computer browsers and mobile devices is available at: https://jakwylaczyccookie.pl/",
                            "The User may at any time delete any Cookie files saved so far using the User's Device tools through which the User uses the services of the Website"
                        ]
                    },
                    {
                        "title": "Service requirements",
                        "bodies": [
                            "Restricting the saving and access to Cookie files on the User's Device may cause some functions of the Website to malfunction",
                            "The Administrator does not bear any responsibility for incorrectly functioning functions of the Website if the User restricts in any way the possibility of saving and reading cookie files"
                        ]
                    },
                    {
                        "title": "Changes to the Cookie Policy",
                        "bodies": [
                            "The Administrator reserves the right to change this Cookie Policy at any time without informing users about it",
                            "The changes made to the Cookie Policy will always be published on this page",
                            "The introduced changes enter into force on the date of publication of the Cookie Policy"
                        ]
                    }
                ]
            },
            {
                "title": "XCHALLENGE WEBSITE PRIVACY POLICY",
                "description": "The privacy policy describes the rules for the processing of information about you, including personal data.",
                "paragrphs": [{
                        "title": "General information",
                        "bodies": [
                            "This policy applies to the XCHALLENGE website (hereinafter: „Application”)",
                            "The owner of the application is: the Scientific Circle of Automation and Robotics 'ROBO', operating at the Rzeszów University of Technology at the address: ul. Wincentego Pola 2, 35-021 Rzeszów",
                            "Operator's e-mail contact address: robo@kneiti.prz.edu.pl",
                            "The application uses personal data for the following purposes:",
                            "- <b> Presenting the user's profile to other users </b>",
                            "- <b> Handling inquiries via the form </b>",
                            "- <b> Presentation of the offer or information </b>",
                            "- <b> Sending internal correspondence </b>",
                            "The application performs the functions of obtaining information about users and their behavior in the following way: by voluntarily entering data in forms, which are then entered into the Operator's systems and by saving cookie files in end devices (so-called  „cookies”)"
                        ]
                    },
                    {
                        "title": "Selected data protection methods used by the Operator",
                        "bodies": [
                            "The places of logging in and entering personal data are protected in the transmission layer (SSL certificate). Thanks to this, personal data and login data entered on the website are encrypted on the user's computer and can be read only on the target server",
                            "User passwords are stored in a hashed form. The hash function works one-way - it is not possible to reverse its operation, which is now a modern standard in the field of storing user passwords.",
                            "The operator changes his administrative passwords periodically."
                        ]
                    },
                    {
                        "title": "Hosting",
                        "bodies": [
                            "The application database is hosted (technically maintained) on the operator's server: smarthost.pl"
                        ]
                    },
                    {
                        "title": "Your rights and additional information on how the data is used",
                        "bodies": [
                            "In some situations, the Administrator has the right to transfer your personal data to other recipients, if it is necessary to perform the contract concluded with you or to fulfill the obligations incumbent on the Administrator. This applies to such groups of recipients:",
                            "- <b> 1. authorized employees and associates who use the data to achieve the purpose of the application </b>",
                            "Your personal data is processed by the Administrator for no longer than it is necessary to perform the related activities specified in separate regulations (e.g. on accounting). With regard to marketing data, the collected data will not be processed for more than 3 years",
                            "You have the right to request from the Administrator",
                            "- <b> 1.access to personal data concerning you, </b>",
                            "- <b> 2. correct them, </b>",
                            "- <b> 3. delete, </b>",
                            "- <b> 4. processing restrictions, </b>",
                            "- <b> 5. and data portability. </b>",
                            "You have the right to object to the processing of personal data in order to perform the legitimate interests pursued by the Administrator, including profiling, but the right to object may not be exercised if there are valid legally justified grounds for processing that override your interests, rights and freedoms, in particular establishing, investigating or defending claims ",
                            "The Administrator's actions may be appealed against to the President of the Personal Data Protection Office, ul. Stawki 2, 00-193 Warsaw",
                            "Providing personal data is voluntary, but necessary to operate the Application",
                            "In relation to you, actions may be taken consisting in automated decision making, including profiling in order to provide services under the concluded contract and for the purpose of conducting direct marketing by the Administrator",
                            "Personal data is not transferred to third countries within the meaning of the provisions on the protection of personal data. This means that we do not transfer them outside the European Union"
                        ]
                    },
                    {
                        "title": "Information in the forms",
                        "bodies": [
                            "The application collects information provided voluntarily by the User, including personal data, if provided",
                            "The application can save information about the connection parameters (time stamp, IP address). The data provided in the form are processed for the purpose resulting from the function of a specific form, e.g. to update the data. Each time the context and description of the form clearly indicate what it is for. serves "
                        ]
                    },
                    {
                        "title": "Administrator logs",
                        "bodies": [
                            "Information about the behavior of users in the application may be subject to logging. These data are used to administer the Application and the database"
                        ]
                    },
                    {
                        "title": "Important Marketing Techniques",
                        "bodies": [
                            "The operator uses a solution that automates the operation of the Website in relation to users, e.g. that can send an email to the user after visiting a specific subpage, provided that he has consented to receive commercial correspondence from the Operator",
                            "The operator uses statistical analysis of website traffic through Google Analytics (Google Inc. based in the US). The operator does not provide the operator of this service with personal data, but only anonymised information. The service is based on the use of cookies on the User's end device. on the User's preferences collected by the Google advertising network. The User can view and edit the information resulting from cookies using the tool: https://www.google.com/ads/preferences/"
                        ]
                    }
                ]
            },
            {
                "title": "TERMS AND CONDITIONS FOR THE USE OF THE XCHALLENGE APP",
                "description": "By creating an account in the XChallenge application, you accept the following conditions.",
                "paragrphs": [{
                        "title": "General information",
                        "bodies": [
                            "The owner of the application and the administrator of personal data is: the Scientific Circle of Automation and Robotics 'ROBO', operating at the Rzeszów University of Technology at the following address: ul. Wincentego Pola 2, 35-021 Rzeszów (hereinafter referred to as the „Application Owner” )",
                            "The application was created to conduct the recruitment process for the International Robot Competition XChallenge, communication with robot builders, presentation of results and promotion of sponsors"
                        ]
                    },
                    {
                        "title": "Privacy policy",
                        "bodies": [
                            "The Application's privacy policy is described in a separate document: Privacy Policy"
                        ]
                    },
                    {
                        "title": "Users",
                        "bodies": [
                            "The application was created for people interested in the XChallenge competition, both those taking part in the competition and the audience"
                        ]
                    },
                    {
                        "title": "Content in Apps",
                        "bodies": [
                            "The owner of the application is responsible for the content of the Application. The user has the right to comment on inappropriate content in the application. This can be done by writing to the following address: robo@kneiti.prz.edu.pl"
                        ]
                    },
                    {
                        "title": "Disclaimer of Liability",
                        "bodies": [
                            "The owner and authors of the Application are not responsible for using it in any way (in particular, it has no influence on whether or not the entity undertakes any action or action)"
                        ]
                    }
                ]
            },
            {
                "title": "TERMS AND CONDITIONS OF INTERNATIONAL COMPETITIONS XCHALLENGE",
                "description": "Last update: 13.11.2021",
                "paragrphs": [{
                        "title": "Definition",
                        "bodies": [
                            "<b>Team</b> – a group of people consisting of Participants and Competitors who independently created at least one Robot or its algorithm, taking part in the Competition.",
                            "<b>Constructor</b> – a personor persons taking part in the competition that created the Robot",
                            "<b>Organizer</b> – a person supervising and influencing the course of the Competition, having a personal identifier with theword “Organizer”",
                            "<b>Robot</b> – a mechatronic device powered by electric energy that moves autonomously and reacts noticeably to changes of environment.",
                            "<b>IdenticalRobots</b> – Robots having a similar design and using similaral gorithms. The Main Referee decides whether the Robots are identical.",
                            "<b>Referee</b> – a person supervising the course of the competition on the day of the Competition.",
                            "<b>Participant</b> – a person who takes active or passive participation in the competition. This could be a Competitor, Referee, Organizer or spectator.",
                            "<b>Competitor</b> – see Constructor."
                        ]
                    },
                    {
                        "title": "General informations",
                        "bodies": [
                            "These regulations define the conditions for participation in the International Robot Competition XChallenge (hereinafter called Competition) and the rules of conduct to prevent the spread of the SARS-CoV-2 virus in Poland",
                            "International Robot Competition XChallenge 2021 is the next edition of the Competition organized by „Koło Naukowe Automatyków i Robotyków ROBO” operating at the Faculty of Electrical Engineering and Computer Science of the Rzeszow University of Technology together with its partners. The aim of the event is to popularize robotics among young people and students.",
                            "The competition will take place on Sunday, November 28, 2021. The duration depends on the number of submitted robots, therefore the final schedule will be made available on the xchallenge.pl website no later than 4 days before the competition, i.e. on Wednesday, November 24, 2021",
                            "The competition will be held in the building of the Regional Sports and Entertainment Center \"Podpromie\" located at 10 Podpromie Street, 35-010 Rzeszow",
                            "The Organizers will supervise the proper course of the Competition. Each of the Organizers will have a personal identifier.",
                            "A necessary condition for joining the Competition is consent to the processing of personal data, including image:",
                            "&nbsp; o Persons of age consent to the processing of personal data and personal data in the form of an image sign on the spot - printouts will be ready - the consent form is available at <a href=\"xchallenge.pl\" target=\"_blank\" style=\"color:yellow;\">xchallenge.pl</a>",
                            "&nbsp; o Minors are asked to bring a printed consent form signed by the Parent / Legal Guardian on the day of the Tournament - the consent form for a minor is available at <a href=\"xchallenge.pl\" target=\"_blank\" style=\"color:yellow;\">xchallenge.pl</a>"
                        ]
                    },
                    {
                        "title": "Participants",
                        "bodies": [
                            "Adults may take part in the Competition, who consent to the processing of personal data, including their images, and accept the regulations. In the case of minors, written consent of the parent or legal guardian to participate in the Competition is required, consent to the processing of personal data, including image, and acceptance of the regulations - the form is available at <a href=\"xchallenge.pl\" target=\"_blank\" style=\"color:blue;\">xchallenge.pl</a>",
                            "Teams of 1-20 people may register for the Competition",
                            "Each team without an adult must come to the competition under the supervision of an adult - a guardian",
                            "During registration on the day of the competition, each team member must have an identity document and present it at the request of the Organizer, Referee or Staff.",
                            "Registering a team in the Competition on the website <a href=\"xchallenge.pl\" target=\"_blank\" style=\"color:yellow;\">xchallenge.pl</a> is tantamount to accepting the General Regulations of the Competition and the regulations of individual competitions.",
                            "Each passive or active participant, starting or not taking part in the Competition, participating in the event, is obliged to comply with all the Competition Regulations and the Regulations in force in the building of the Regional Sports and Entertainment Center \"Podpromie\". Entering the event area is tantamount to accepting the regulations",
                            "Ignorance of any of the Regulations does not exempt the participant from the necessity to comply with them",
                            "The organizers undertake not to disclose the telephone number provided during registration to third parties without the consent of the number owner"
                        ]
                    },
                    {
                        "title": "Competitions",
                        "bodies": [
                            "There will be 17 separate competitions. One team can take part in several of them, however the different stages of different competitions can take place at the same time",
                            "Competitions that will be held at the event:",
                            "&nbsp;<b>Smash Bots by RoboLAB</b>",
                            "&nbsp;<b>LEGO Sumo</b>",
                            "&nbsp;<b>Nano Sumo</b>",
                            "&nbsp;<b>Micro Sumo</b>",
                            "&nbsp;<b>Mini Sumo</b>",
                            "&nbsp;<b>Sumo</b>",
                            "&nbsp;<b>LineFollower Standard</b>",
                            "&nbsp;<b>LineFollower Standard LEGO</b>",
                            "&nbsp;<b>LineFollower Turbo</b>",
                            "&nbsp;<b>LineFollower Standard Enhanced</b>",
                            "&nbsp;<b>LineFollower Turbo Enhanced</b>",
                            "&nbsp;<b>Drag Race</b>",
                            "&nbsp;<b>Cebula House</b>",
                            "&nbsp;<b>Micromouse</b>",
                            "&nbsp;<b>Robot Sprint</b>",
                            "&nbsp;<b>LEGO Tug of War</b>",
                            "&nbsp;<b>Freestyle</b>",
                            "The exact regulations of each competition can be found on the home page of <a href=\"xchallenge.pl\" target=\"_blank\" style=\"color:yellow;\">xchallenge.pl</a> the link to the regulations is available after selecting the appropriate category",
                            "In the case of a small number of teams participating in a given competition, the organizer reserves the right to play only the final phase or to cancel the competition."

                        ]
                    },
                    {
                        "title": "Organizational matters",
                        "bodies": [
                            "The organizer reserves the right to amend these regulations.",
                            "Prizes are awarded on a team basis.",
                            "The robot and the program taking part in a given competition must be authored only and exclusively by the members of a given team.",
                            "Any questions regarding the regulations should be directed to robo@kneiti.prz.edu.pl"
                        ]
                    },
                    {
                        "title": "Rules of conduct to counteract the spread of SARS-CoV-2 virus in Poland",
                        "bodies": [
                            "Each participant is obliged to cover his mouth and nose only with a protective mask on the premises of the event, the participant himself is obliged to have an appropriate number of protective masks. The organizer reserves the right to ask or refuse to admit a person who does not have a protective mask or an appropriate certificate confirming the inability to wear a protective mask, accepted by the currently applicable legal regulations, to the event area.",
                            "The organizer provides an appropriate amount of disinfectants that will be placed throughout the facility.",
                            "The number of seats in the audience will be limited, only the unfolded seats (with the backrest raised) may be occupied, while the seats with the backrest down (folded) are excluded from use.",
                            "Each participant also undertakes to maintain the required social distance.",
                            "The organizer reserves the right to admit to the event area only people fully vaccinated against SARS-CoV-2 in the event that the maximum number of people allowed on the basis of the currently applicable restrictions are present in the hall",
                            "The organizers of the event are required to provide the collected personal data to the State Poviat Sanitary Inspector who performs epidemiological supervision in a given area and to the security services at their request."
                        ]
                    },
                    {
                        "title": "Disputes, liability",
                        "bodies": [
                            "All disputes related to the category described in the regulations of the category are resolved by the judge of the given category.",
                            "All disputes and situations not described in the Regulations of the categories are resolved by the Main Judge.",
                            "Any disputes and situations not described in these regulations and not related to any category will be settled by the Organizer in accordance with applicable law and safety regulations.",
                            "In the event of the Participant's behavior that violates: moral standards, good manners, human dignity, religious feelings or safety of the Participants, the Main Referee or the Organizers have the right to impose a penalty on the Participant in the form of a ban on staying at the event, in which case the punished Participant is obliged to leave the event area immediately.",
                            "The decision of the Chief Referee and the Organizer is final."
                        ]
                    },
                    {
                        "title": "Agreements",
                        "bodies": [
                            "Participation in the competition means consent to the publication of the image (photos from the competition, recordings of the competition and video materials transmitted live using appropriate platforms), basic data about the robot and the team by the Competition Organizers and Partners without the need to inform the Participant about it."
                        ]
                    },
                    {
                        "title": "Final Provision",
                        "bodies": [
                            "Personal data of the Competition participants will be processed only for the purposes of conducting the Competition, selecting the winners and awarding, issuing, receiving and settling the terms of prizes and distinctions.",
                            "The administrator of personal data is Rzeszow University of Technology names of Ignacy Łukasiewicz with its seat at al. Powstańców Warszawy 12, 35-959 Rzeszow",
                            "Processing of personal data in connection with participation in the Competition includes the publication of the image, name and surname and result of the participant who won one of the Competition awards. Each of the remaining participants of the Competition will have the opportunity to consent to the disclosure of its result, name and e-mail address to the companies organizing the Competition. Data and detailed results of participants of the Competition who do not give their consent will not be disclosed.",
                            "Data processing concerns all participants of the Competition. Participants have the right to access their personal data and to correct them. Providing personal data (name, surname, school or university, e-mail address) is voluntary, but failure to do so prevents participation in the Competition. By joining the Competition, participants consent to the processing of their data for the purpose specified in these Regulations",
                            "The competition is organized according to the fair-play principle. In the event of breaking the rules of this idea, e.g. by deliberately damaging another participant's robot, the Competition organizers reserve the right to exclude the entire team of the participant from this and subsequent editions of the ROBO ~ motion International Competition",
                            "In matters not covered by the Regulations, the provisions of the Civil Code shall apply"
                        ]
                    }
                ]
            },
            {
                "title": "INFORMACJA ADMINISTRATORA W ZWIĄZKU Z PRZETWARZANIEM DANYCH OSOBOWYCH",
                "paragrphs": [{
                    "title": "Informacje ogólne",
                    "bodies": [
                        "The administrator of personal data is the Ignacy Łukasiewicz University of Technology in Rzeszów al. Powstańców Warszawy 12, 35-959 Rzeszow, (hereinafter referred to as the University), email address: kancelaria@prz.edu.pl",
                        "The Data Protection Supervisor at the Rzeszow University of Technology can be contacted by calling 17 865 1775 or by e-mail: iod@prz.edu.pl",
                        "The administrator processes your personal data in accordance with the Regulation pursuant to Article 13 (1) (2) of Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46 / EC (hereinafter referred to as GDPR).",
                        "The Administrator collects and processes the following personal data of the Participant provided via the registration form on the website xchallenge.pl: name and surname, e-mail address and telephone number.",
                        "&nbsp; a) based onconsent to register participants and organize the competition (Article 6 (1) (a) of the GDPR)-providing the above data is voluntary, however, it is necessary for registration and participation in the 6th International XChallenge Competition,",
                        "&nbsp; b) based on consent consent for marketing and promotional purposes related to the offer of the Partners and the Organizer (Article 6 (1) (a) of the GDPR) - consent is voluntary, it can be withdrawn at any time.",
                        "During the International XChallenge Competition, photo and video sessions will be held, the Administrator and the Organizer's Partners will process the Participant's imagebased on his consentor in the case of minors, on the basis of consent expressed by their legal guardians (Article 6 (1) (a) of the GDPR). Granting consent for image processing is voluntary, but necessary to participate in the International XChallenge Competition. Consent is available under this <a href=\"https://rzit.smarthost.pl/robomotion/rodo.pdf\" target=\"_blank\">link</a>.",
                        "Each Participant is entitled to:",
                        "&nbsp; a) request access to data and obtain information on their processing",
                        "&nbsp; b) rectify data and demand their removal or limitation of processing",
                        "&nbsp; c) object to processing",
                        "&nbsp; d) withdraw consent to the processing of data at any time - this withdrawal, however, does not affect the compliance of the processing prior to its execution",
                        "&nbsp; e) lodging a complaint to the supervisory body regarding the protection of personal data - in Poland to the President of the Office for Personal Data Protection",
                        "In order to exercise the above rights, please contact the Organizer."
                    ]
                }]
            }
        ]
    },
    "thank-you": {
        "title": "Thank you!",
        "title-top": "Acknowledgments",
        "signature": "Yours faithfully, Organizers",
        "description": "It is thanks to people like you that we are able to create this event. We express great gratitude for your support and commitment. We hope that the first edition of the International Robot Competition XChallenge was an opportunity for an inspiring exchange of ideas, information and experiences related to robotics and technologies of the future. Thank you for joining the large group of our recipients. It is an honor and motivation for us to continue. We would like to host you during the next edition of our Competition!"
    },
    "dialog-box": {
        "yes": "Continue",
        "no": "Cancel",
        "continue": "Do you want to continue?"
    },
    "controls": {
        "name": {
            "name": "Name",
            "validators": {
                "required": "This field is required",
                "minlength": "Name must be longer than 2 characters",
                "maxlength": "Name must be less than 40 characters"
            }
        },
        "surname": {
            "name": "Surname",
            "validators": {
                "required": "This field is required",
                "minlength": "Surname must be longer than 2 characters",
                "maxlength": "Surname must be less than 40 characters"
            }
        },
        "email": {
            "name": "E-mail",
            "validators": {
                "required": "This field is required",
                "pattern": "Please enter a valid email address",
                "minlength": "E-mail must be longer than 2 characters",
                "maxlength": "E-mail must be less than 100 characters"
            }
        },
        "password": {
            "name": "Password",
            "validators": {
                "required": "This field is required",
                "minlength": "Password must be longer than 6 characters",
                "maxlength": "Password must be less than 64 characters"
            }
        },
        "repeatPassword": {
            "name": "Repeat password",
            "validators": {
                "required": "This field is required",
                "confirmedValidator": "The passwords do not match"
            }
        },
        "actualPassword": {
            "name": "Current password",
            "validators": {
                "required": "This field is required",
                "minlength": "Password must be longer than 6 characters",
                "maxlength": "Password must be less than 64 characters"
            }
        },
        "newPassword": {
            "name": "New password",
            "validators": {
                "required": "This field is required",
                "minlength": "Password must be longer than 6 characters",
                "maxlength": "Password must be less than 64 characters"
            }
        },
        "repeatNewPassword": {
            "name": "Repeat new password",
            "validators": {
                "required": "This field is required",
                "minlength": "Password must be longer than 6 characters",
                "maxlength": "Password must be less than 64 characters"
            }
        },
        "category": {
            "name": "Category",
            "validators": {
                "required": "This field is required"
            }
        },
        "robot_name": {
            "name": "Robot name",
            "validators": {
                "required": "This field is required",
                "minlength": "Robot name must be longer than 2 characters",
                "maxlength": "Robot name must be less than 40 characters"
            }
        },
        "phone": {
            "name": "Phone number (optional)",
            "validators": {
                "required": "This field is required",
                "minlength": "Phone number must be longer than 7 characters",
                "maxlength": "Phone number must be less than 15 characters",
                "pattern": "Enter correct phone number (without country code)"
            }
        },
        "constructor_uuid": {
            "name": "New constructor UUID",
            "validators": {
                "required": "This field is required",
                "minlength": "Please enter a valid user UUID",
                "maxlength": "Please enter a valid user UUID",
                "alreadyExistValidator": "The user is already the constructor of this robot"

            }
        },
        "position": {
            "name": "Position",
            "validators": {
                "required": "This field is required"
            }
        },
        "time": {
            "name": "Score",
            "validators": {
                "required": "This field is required",
                "maxlength": "The time cannot be greater than 999999ms"
            }
        },
        "fight_result": {
            "name": "Result of the fight",
            "validators": {
                "required": "This field is required",
                "maxlength": "The result must be single-digit",
                "minlength": "The result must be single-digit"
            }
        },
        "filter": {
            "name": "Filter by",
            "validators": {}
        },
        "filter_name": {
            "name": "Value",
            "validators": {}
        },
        "postal_code": {
            "name": "Postal code (optional)",
            "validators": {
                "required": "This field is required",
                "maxlength": "The postal code must be longer than 2 characters",
                "minlength": "The postal code must be less than 8 characters"
            }
        },
        "message": {
            "name": "Message to user",
            "validators": {
                "required": "This field is required",
                "maxlength": "The message must be longer than 2 characters",
                "minlength": "The message must be less than 500 characters"
            }
        },
        "code": {
            "name": "Confirmation code",
            "validators": {
                "required": "This field is required",
                "maxlength": "The code is 6 characters long",
                "minlength": "The code is 6 characters long"
            }
        },
        "preferedFood": {
            "name": "Prefered food",
            "validators": {
                "required": "This field is required"
            }
        },
        "tshirtSize": {
            "name": "T-Shirt size",
            "validators": {
                "required": "This field is required"
            }
        },
        "documentation": {
            "name": "Documentation file",
            "validators": {
                "required": "This field is required"
            }
        },
        "movie": {
            "name": "Link to the movie",
            "validators": {
                "required": "This field is required"
            }
        },
        "reason": {
            "name": "Reason for rejection",
            "validators": {
                "required": "This field is required",
                "maxlength": "The maximum length of an entry is 1000 characters"
            }
        },
        "user_type": {
            "name": "User type",
            "validators": {
                "required": "This field is required"
            }
        },
        "payload": {
            "name": "Payload",
            "validators": {
                "required": "This field is required"
            }

        },
        "option": {
            "name": "Create option",
            "validators": {
                "required": "This field is required"
            }
        },
        "count": {
            "name": "Number to final",
            "validators": {
                "required": "This field is required"
            }
        },
        "next_fight": {
            "name": "Next fight",
            "validators": {
                "required": "This field is required"
            }
        },
        "referee": {
            "name": "Referee",
            "validators": {
                "required": "This field is required"
            }
        },
        "group_name": {
            "name": "Group name",
            "validators": {
                "required": "This field is required"
            }
        }
    },
    "errors": {
        "names": {
            "success": "Success",
            "warning": "Warning!",
            "error": "Error!",
            "loading": "Information"
        },
        "details": {
            "no-category": "There is no such category!",
            "no-fighting-category": "This is not a fight category!",
            "no-time-category": "This is not a category of racing on time!",
            "no-group": "There is no such group!",
            "no-robot": "Such a robot does not exist!",
            "no-robot-1": "Such a robot 1 does not exist!",
            "no-robot-2": "Such a robot 2 does not exist!",
            "robot-not-arrived": "The robot did not come to the event!",
            "robot-not-arrived-1": "The robot 1 did not come to the event!",
            "robot-not-arrived-2": "The robot 2 did not come to the event!",
            "robot-self-fight": "The robot cannot fight against itself!",
            "robot-no-category": "The robot does not have such a category!",
            "robot-no-category-1": "The robot 1 does not have such a category!",
            "robot-no-category-2": "The robot 2 does not have such a category!",
            "no-position": "Such a position does not exist!",
            "position-no-referee": "The position does not have such a referee!",
            "position-no-category": "The position does not have such a category!",
            "no-user": "This user does not exist!",
            "user-not-activated": "User has not been activated.",
            "user-have-email": "The user already has a confirmed email.",
            "not-referee": "The user is not a judge.",
            "user-have-phone": "The user already has a confirmed phone number.",
            "no-user-phone": "The user does not have an assigned phone number!",
            "user-phone-exist": "The user already has an assigned phone number.",
            "email-exist": "User with such email already exists!",
            "phone-number-exist": "This phone number is already assigned to another user.",
            "no-constructor": "There is no such constructor!",
            "constructor-exist": "Such a constructor already exists.",
            "invalid-email": "Please enter a valid value for the target mailbox!",
            "code-recently-generated": "The code was recently generated. Please try to generate a new code later.",
            "no-code": "The confirmation code has not been generated or has expired.",
            "no-message": "Such a message does not exist!",
            "no-fight": "Such a fight does not exist!",
            "no-time": "Such a time result does not exist!",
            "invalid-code": "The confirmation code does not match the one entered by the user.",
            "invalid-password": "Incorrect password.",
            "new-password": "The new password must be different from the previous one.",
            "fight-is-assigned": "The fights are already arranged",
            "fight-not-assigned": "The fight has not yet been set!",
            "fight-played": "The outcome of the fight has already been determined",
            "fight-must-end": "The fight must come to an end!",
            "fight-second-robot": "Before adding the result, add a second robot to the fight!",
            "fight-no-edit": "This fight can no longer be edited as the next one has already ended",
            "last-category": "The only robot category cannot be deleted!",
            "too-many-constructors": "You cannot add more than 20 constructors!",
            "too-many-categories": "You cannot add more than 4 robot categories!",
            "too-many-lf-categories": "You cannot add more than 2 categories in the Line Follower competition!",
            "too-many-sumo-categories": "You cannot add more than 2 categories in the Sumo competition!",
            "time-to-modify-ended": "The time to add and modify robots is over",
            "time-to-modify-ended-smash": "The time to add and modify robots in the SmashBots category is over",
            "register-ends": "Registration has ended"
        },
        "statusCodes": {
            "400": "Incorrectly specified data - user error",
            "401": "Unauthorized Access - Authentication Required",
            "402": "Fee required",
            "403": "Forbidden",
            "404": "Not found - the server did not find the resource",
            "405": "Illegal method - the method contained in the request is not allowed for the indicated resource",
            "406": "The given data is incorrect",
            "407": "Proxy authentication required",
            "408": "End of waiting time for request",
            "409": "Conflict - request cannot be processed",
            "410": "Disappeared (deleted) - requested resource is no longer available",
            "411": "Length required - the server refuses to complete the request due to the lack of a header",
            "412": "The precondition cannot be met - the server cannot meet at least one of the query conditions",
            "413": "Query entity too long",
            "414": "Request URI too long",
            "415": "Unknown request method",
            "416": "Byte range specified in the query unsupported",
            "417": "Expected value cannot be returned",
            "418": "I am a kettle",
            "421": "The request was directed to a server that should not receive it or is unable to answer it",
            "422": "The query was worded correctly but could not be continued",
            "423": "Attempting to access a resource that is currently locked",
            "424": "The request failed because it depends on another request that also failed",
            "425": "The server does not want to risk processing a request that may be repeated",
            "426": "The server is refusing to execute the request using the current protocol",
            "428": "No pre-header that is required by the server",
            "429": "User sent too many requests in the given time",
            "431": "The server refuses to execute the request because the header field or fields are too large",
            "444": "The connection was closed without receiving a response",
            "451": "Content unavailable for legal reasons",
            "499": "The client terminated the connection",
            "500": "Internal server error - the server encountered unexpected difficulties that prevented the request from being fulfilled",
            "501": "Not implemented - the server does not have the functionality required in the query",
            "502": "Gateway error - server - acting as gateway or intermediary - received an incorrect response from the parent server",
            "503": "Service unavailable - the server is not able to process the query at the moment",
            "504": "Gateway timeout - server - acting as gateway or intermediary - did not receive a response from the indicated server within the set time",
            "505": "HTTP Version Unsupported",
            "506": "Variant also negotiates",
            "507": "The server is unable to save the data related to the query",
            "508": "The server detected an infinite loop while processing a query",
            "510": "No HTTP extension needed to service the request",
            "511": "Authentication required before accessing the network",
            "599": "Network connection timeout error"
        }
    },
    "cookies": {
        "p": "Information: The website uses <b> cookies </b> to function properly",
        "button": "Agree"
    }
}
